mdhardenburgh/Blinky/Packages/.cache/NXP.MK64F12_DFP.12.0.0.pdsc
    <condition id="device.MK64F12_AND_driver.gpio_AND_driver.port">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.common_AND_driver.i2c">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.common_AND_driver.lptmr">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="device.MK64F12_AND_component.lists_AND_driver.common">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.common_AND_utility.debug_console">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MK64F12_AND_component.serial_manager_AND_core_type.cm4f_AND_driver.common">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.uart">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.codec_AND_driver.sgtl5000">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.common_AND_driver.uart">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Include_core_cm4">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.dspi_edma">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.Ethernet_AND_CMSIS_Driver_Include.Ethernet_MAC_AND_CMSIS_Driver_Include.Ethernet_PHY_AND_RTE_Device_AND_driver.enet_AND_driver.phyksz8041">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phyksz8041"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="enet"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.1.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.1.0"/>
      <require Cclass="CMSIS Driver" Cgroup="Ethernet" Capiversion="2.1.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c_edma">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK64F12_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.uart_edma">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MK64F12_AND_device.MK64F12_CMSIS_AND_driver.clock">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MK64F12_startup"/>
    </condition>
    <condition id="device.MK64F12_AND_driver.dspi_AND_driver.edma">
      <accept Dname="MK64FN1M0???12*" Dvendor="NXP:11"/>
      <accept Dname="MK64FX512???12*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
